Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/extradition_to_and_from_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Extradition to and from Ireland
ga: Eiseachadadh chuig agus ó Éirinn

source: Extradition means the transfer of someone from one country to another for the purpose of prosecution or punishment for an offence of which they have been convicted
ga: Ciallaíonn eiseachadadh go ndéantar duine a aistriú ó thír amháin go tír eile chun iad a ionchúiseamh nó chun pionós a chur orthu de bharr ciona ciontaithe

source: In general, extradition is only possible if there is an extradition agreement between the two countries in question
ga: De ghnáth, ní fhéadtar duine a eiseachadadh ach amháin nuair a bhíonn comhaontú eiseachadta ann idir an dá thír

source: This means that Ireland must have an agreement with the other country before someone can be extradited to or from Ireland
ga: Dá bhrí sin, ba cheart comhaontú a bheith ann idir Éire agus an tír eile roimh dhuine a eiseachadadh chuig nó ón tír seo

source: Individual countries also have specific rules about extradition
ga: Ina theannta sin, tá rialacha eiseachadta sainiúla ag na tíortha difriúla

source: For example, Ireland does not allow extradition for the purposes of investigation of a criminal offence only
ga: Mar shampla, ní dhéantar daoine a eiseachadadh ón tír seo de bharr imscrúdaithe ciona coiriúil amháin

source: Since 2004, extradition between EU member states has been governed by the European Arrest Warrant Framework Decision
ga: Ó 2004 ar aghaidh, rialaítear eiseachadadh idir na tíortha AE bunaithe ar Chreatchinneadh Barántais Ghabhála na hEorpa

source: This has been implemented in Ireland by the European Arrest Warrant Act 2003
ga: Cuireadh é seo i bhfeidhm in Éirinn bunaithe ar an Acht um Barántas Gabhála Eorpach 2003

source: Extradition to other countries from Ireland is governed by the Extradition Act 1965 as amended
ga: Rialaítear eiseachadadh ón tír seo go tíortha eile leis an Acht um Eiseachadadh 1965 (Leasú)

source: Extradition from Ireland to non-EU Countries
ga: Eiseachadadh ó Éireann go Tíortha Neamh-AE eile

source: You may be extradited from Ireland to countries with which Ireland has extradition agreements where certain conditions are met
ga: Féadtar daoine a eiseachadadh ó Éireann go tíortha eile nuair a bhíonn comhaontú eiseachadta idir an dá thír agus nuair a chomhlíontar coinníollacha áirithe

source: The most important conditions are:
ga: Is iad seo a leanas na coinníollacha is tábhachtaí:

source: • You are charged with an offence: punished by imprisonment in Ireland and in the other country for at least a year
ga: • Nuair a dhéantar duine a chúiseam bíonn orthu am a chaitheamh sa phríosún in Éirinn nó sa tír eile ar feadh bliain amháin ar a laghad

source: Or, you are convicted of such an offence, and a sentence of at least four months has been imposed
ga: Nó nuair a dhéantar duine a chúiseamh de bharr ciona dá leithéid, agus bíonn orthu ceithre mhí ar a laghad a chaitheamh sa phríosún

source: This principle, that the offence must be the same in the two countries is known as the principle of dual criminality
ga: Úsáidtear an téarma déchoiriúlacht chun a thaispeáint go bhfuil an cion céanna i gceist sa dhá thír

source: You may not be extradited if you are going to be held in custody for the purpose of investigation
ga: Ní fhéadtar duine a eiseachadadh chun iad a choinneáil i gcoimeád de bharr cúiseanna imscrúdaithe

source: • The offence is not a political offence: or one connected with a political offence. The definition of political offence was initially quite wide but has now been narrowed considerably
ga: • Ní chion polaitiúil nó cion a bhaineann le cion polaitiúil: Ar dtús, cuireadh a lán cionta san áireamh faoi chionta polaitiúla, ach giorraíodh an liosta seo

source: In general, it does not include terrorist type offences
ga: Ní chuirtear cionta sceimhlitheoireachta san áireamh de ghnáth

source: • The death penalty does not apply to the offence
ga: • Ní bhaineann pionós an bháis leis an gcion

source: The authorities in the other country requesting your extradition from Ireland, apply to the Minister for Justice and Equality for your extradition
ga: Bíonn ar na húdarás sa tír eile, atá ag lorg duine a eiseachadadh ó Éireann, iarratas a chur isteach chuig an Aire Dlí agus Cirt agus Comhionannais

source: All extradition proceedings are then dealt with by the High Court
ga: Déantar imeachtaí eiseachadta a phlé san Ard-Chúirt

source: The usual rules in relation to criminal trials apply to extradition prodeedings
ga: Baineann gnáthrialacha trialach coiriúil le himeachtaí eiseachadta

source: Extradition between EU member states - European Arrest Warrant
ga: Eiseachadadh idir Ballstáit an AE – Barántas Gabhála Eorpach

source: Since 1 January 2004 a European Arrest Warrant (EAW) valid throughout the EU has replaced extradition procedures between EU member states
ga: Ón 1 Eanáir 2004 ar aghaidh, úsáidtear córas nua ar fud an AE chun daoine a ghabháil, ar a dtugtar Barántas Gabhála Eorpach (BGE), in ionad na n-imeachtaí eiseachadta a bhí ann roimhe sin idir Ballstáit an AE

source: An European Arrest Warrant may be issued by a national judicial authority if the person whose return is sought is accused of an offence for which the maximum penalty is at least a year in prison or if he or she has been sentenced to a prison term of at least four months
ga: Is féidir le húdarás dlíthiúil náisiúnta Barántas Gabhála Eorpach a eisiúint má dhéantar iarracht duine cúisithe a thabhairt ar ais chuig an tír nuair a bhíonn cion i gceist le uasphíonós de bhliain amháin i bpríosún ar a laghad, nó má leagadh amach téarma phríosúnachta de ceithre mhí ar a laghad

source: The European Arrest Warrant Act 2003 implements the procedures in Ireland
ga: Caithfear glacadh leis na nósanna imeachta seo in Éirinn de bharr an Achta um Barántas Gabhála Eorpach 2003

source: It applies to extradition between two EU countries and does not affect extradition to any other country
ga: Baineann an acht seo le heiseachadadh idir tíortha an AE, gan eiseachadadh do thíortha lasmuigh den AE a chur san áireamh

source: The Irish legislation implements the EU framework decision of 13 June 2002 on the European Arrest Warrant
ga: Cuirtear creatchinneadh an AE ón 13 Meitheamh 2002, maidir le Barántas Gabhála Eorpach i bhfeidhm in Éirinn de réir reachtaíochta na tíre

source: At the time that decision was adopted, Ireland made a statement to the effect that it would implement the decision for the purposes of bringing a person to trial or for the purpose of executing a custodial sentence or detention order
ga: Nuair a eisíodh an cinneadh, glacadh leis sa tír seo chun daoine cúisithe a thriail nó chun pianbhreith choimeádta nó ordú coinneála a chomhlíonadh

source: The idea is to ensure that a person may not be extradited from Ireland and kept in custody for investigation purposes
ga: Is é atá i gceist ná deimhin a dhéanamh de nach ndéanfar duine a eiseachadadh ó Éireann agus a choinneáil faoi choimeád de bharr cúiseanna imscrúdaithe

source: As a general rule, it is not legal to arrest a person in Ireland in order to investigate an offence, it is only legal to arrest them in order to charge them with an offence
ga: Mar riail ghinearálta, ní fhéadtar duine a ghabháil in Éirinn chun imscrúdú ciona a dhéanamh, ní fhéadtar iad a ghabháil ach amháin chun iad chúiseamh i gcion

source: This is not the case in a number of EU countries
ga: Ní hé sin an scéal i dtíortha AE áirithe

source: This statement is reflected in the European Arrest Warrants Act 2003
ga: Tá an ráiteas seo le feiceáil sna hAchtanna um Barántas Gabhála Eorpach 2003

source: Until January 2004, dual criminality was required in respect of all offences
ga: Roimh Eanáir 2004, bhí déchoiriúlacht de dhíth i leith gach ciona

source: This meant that you could be extradited to face prosecution or service of a sentence in another state only where the offences concerned were offences under the laws of both states
ga: Dá bhrí sin, féadtar duine a eiseachadadh chun iad a ionchúiseamh nó chun pianbhreith a chur isteach i stát eile, nuair a bhíonn cion i gceist faoin dlí sa dá stát

source: Dual criminality is no longer a requirement for extradition between EU member states in respect of certain major offences which are listed in the European Arrest Warrants Act 2003
ga: Níl an ceanglas déchoiriúlachta le comhlíonadh a thuilleadh maidir le heiseachadadh idir Ballstáit an AE, i gcás roinnt tromchionta áirithe a luaitear san Acht um Barántas Gabhála Eorpach 2003

source: They include participation in a criminal organisation, terrorism, trafficking in human beings, sexual exploitation of children and child pornography; trafficking in arms, ammunition and explosives; corruption, fraud, money laundering and counterfeiting of money
ga: Is iad seo a leanas roinnt de na cionta seo: rannpháirtíocht in eagraíocht choiriúil, sceimhlitheoireacht, gáinneáil i ndaoine, dúshaothrú gnéasach a bhaineann le leanaí, pornagrafaíocht leanaí; gáinneáil in airm, i lón lámhaigh agus i bpléascáin; éillitheacht, calaois, sciúradh airgid agus góchumadh ar airgead

source: European Arrest Warrants issued in respect of crimes or alleged crimes on this list have to be executed by the arresting state irrespective of whether or not the definition of the offence is the same, providing that the offence is serious enough and punishable by at least 3 years' imprisonment in the member state that has issued the warrant
ga: Tá an stát, ina lorgaítear an duine cúisithe, freagrach as Barántais Ghabhála Eorpacha, a eisíodh i leith coireanna nó i leith coireanna líomhanta a luaitear ar an liosta seo, a chomhlíonadh. Caithfear é seo a dhéanamh fiú amháin má bhíonn sainmhíniú ciona difriúil i gceist sa dá thír, nuair a bhíonn tromchion i gceist agus nuair a bhíonn ar an duine cúisithe 3 bliana ar a laghad a chaitheamh i bpríosún sa bhallstát inar eisíodh an barántas

source: The dual criminality requirement remains for all other offences
ga: Caithfear an ceanglas déchoiriúlachta a chomhlíonadh i leith gach ciona eile

source: Timeframe for European Arrest Warrants
ga: Tráthchlár na mBarántas Gabhála Eorpach

source: A decision on whether or not to extradite someone should normally be taken within 60 days of their arrest or, if this is not possible, within 90 days
ga: Ní mór cinneadh a dhéanamh de ghnáth maidir le heiseachadadh duine laistigh de 60 lá tar éis iad a ghabháil, nó laistigh de 90 lá i gcásanna speisialta

source: These are not legally binding limits but are indicative of the time scales involved
ga: Ní teorainneacha iad seo a bhíonn ina gceangal de réir dlí, ach teorainneacha a n-úsáidtear mar threoir ama amháin

source: Each member state nominates a central authority for the purposes of the European Arrest Warrant
ga: Tá gach ballstát freagrach as lárúdarás a ainmniú chun Barántais Ghabhála Eorpacha a bhainistiú

source: In Ireland, this authority is the Department of Justice and Equality
ga: Is í an Roinn Dlí agus Cirt agus Comhionannais a dhéanann iad a bhainistiú in Éirinn

source: The High Court is responsible for the execution of European Arrest Warrants received by Ireland
ga: Is í an Ard-Chúirt a chomhlíonann na Barántais Gabhála Eorpacha a fhaightear in Éirinn

source: The Director of Public Prosecutions may apply Court for the issue of a European Arrest Warrant where a person in another member state is facing charges or is required to serve a sentence in Ireland
ga: Is féidir leis an Stiúrthóir Ionchúiseamh Poiblí iarratas cúirte a chur isteach chun Barántas Gabhála Eorpach a eisiúint i leith duine atá ina c(h)ónaí i dtír AE eile, agus gur gá iad a thabhairt os comhair na cúirte in Éirinn nó tréimhse ama a chaitheamh i bpríosún ann

source: Irish legislation on European Arrest Warrants
ga: Reachtaíocht Éireannach i ndáil le Barántais Ghabhála Eorpacha

source: Part II of the Extradition Act 1965 provides for extradition between Ireland and countries other than the UK
ga: Forálann Cuid II den Acht um Eiseachadadh 1965 d’eiseachadadh idir Éire agus tíortha eile, seachas an RA

source: This legislation is modelled on the 1957 Council of Europe Convention on Extradition to which Ireland is a party
ga: Bunaítear an reachtaíocht seo ar Choinbhinsiún um Eiseachadadh Chomhairle na hEorpa 1957 ina bhfuil páirt á ghlacadh ag an tír seo

source: Ireland is also a party to a number of international conventions which provide special extradition arrangements in relation to specific offences - for example, in the aviation field
ga: Tá páirt á ghlacadh freisin ag an tír seo i roinnt choinbhinsiúin idirnáisiúnta eile inar leagadh amach socraíochtaí eiseachadta speisialta i leith cionta áirithe – mar shampla, san earnáil eitlíochta

source: The 1965 Act has been amended on a number of occasions. In fact, Part III of the 1965 Act dealing with extradition between Ireland and the UK was repealed by the European Arrest Warrant Act 2003
ga: Is amhlaidh áfach gur aisghairíodh Cuid III den Acht 1965 a bhaineann le heiseachadadh idir Éire agus an RA faoin Acht um Barántas Gabhála Eorpach 2003

source: The Extradition (European Convention on the Suppression of Terrorism) Act 1987 is based on the European Convention on the Suppression of Terrorism
ga: Tá an tAcht um Eiseachadadh 1987 (Coinbhinsiún Eorpach chun Sceimhliú a Dhíchur) bunaithe ar an gCoinbhinsiún Eorpach chun Sceimhliú a Dhíchur

source: This legislation restricts the circumstances in which a person can avoid extradition on the grounds that the offence in question is a political offence or an offence connected with a political offence
ga: Cuireann an reachtaíocht seo teorainn leis an méid iarrachtaí gur féidir le duine a dhéanamh chun eiseachadadh a sheachaint i gcás ciona polaitiúil nó i gcás ciona a bhaineann le cion polaitiúil

source: The underlying principle of the terrorism convention was that perpetrators of acts of terrorism should not be immune from extradition, by pleading that the act they had committed was a political offence
ga: Bunaíodh an coinbhinsiún sceimhlitheoireachta chun deimhin a dhéanamh de gur féidir sceimhlitheoirí a eiseachadadh, fiú amháin má dhéanann siad iarracht a thaispeáint gur cion polaitiúil a bhí i gceist

source: The Extradition (Amendment) Act 1994 extended the range of offences that could not be regarded as political for extradition purposes
ga: Shín an tAcht um Eiseachadadh (Leasú), 1994 an réimse cionta nach bhféadfaí caitheamh leo amhail bheith polaitiúil ar mhaithe le cuspóirí eiseachadta

source: The Extradition (European Union Conventions) Act 2001 provided for the implementation of the 1995 and 1996 Conventions on Simplified Extradition Procedure between the member states of the European Union
ga: Cuireadh an tAcht um Eiseachadadh 2001 (Coinbhinsiúin an Aontais Eorpaigh) i bhfeidhm idir Ballstáit an Aontais Eorpaigh de bharr na Coinbhinsiúin 1995 agus 1996 um Nós Imeachta Simplithe Eiseachadta

source: The Act also provides that all extradition proceedings are to be heard in the High Court
ga: Ina theannta sin, forálann an Acht go gcaithfear imeachtaí eiseachadta a phlé san Ard-Chúirt

source: Information on the European Arrest Warrant is available on the Europa.eu website
ga: Tá eolas ar an mBarántas Gabhála Eorpach le fáil ar an láithreán gréasáin Europa.eu
